; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p11---int100n150-m25---int100c200---s197---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 - fuellevel
)

(:init
(sum level0 level6 level6)
(sum level0 level9 level9)
(sum level0 level10 level10)
(sum level0 level14 level14)
(sum level0 level16 level16)
(sum level0 level21 level21)
(sum level1 level6 level7)
(sum level1 level9 level10)
(sum level1 level10 level11)
(sum level1 level14 level15)
(sum level1 level16 level17)
(sum level1 level21 level22)
(sum level2 level6 level8)
(sum level2 level9 level11)
(sum level2 level10 level12)
(sum level2 level14 level16)
(sum level2 level16 level18)
(sum level2 level21 level23)
(sum level3 level6 level9)
(sum level3 level9 level12)
(sum level3 level10 level13)
(sum level3 level14 level17)
(sum level3 level16 level19)
(sum level3 level21 level24)
(sum level4 level6 level10)
(sum level4 level9 level13)
(sum level4 level10 level14)
(sum level4 level14 level18)
(sum level4 level16 level20)
(sum level4 level21 level25)
(sum level5 level6 level11)
(sum level5 level9 level14)
(sum level5 level10 level15)
(sum level5 level14 level19)
(sum level5 level16 level21)
(sum level5 level21 level26)
(sum level6 level6 level12)
(sum level6 level9 level15)
(sum level6 level10 level16)
(sum level6 level14 level20)
(sum level6 level16 level22)
(sum level6 level21 level27)
(sum level7 level6 level13)
(sum level7 level9 level16)
(sum level7 level10 level17)
(sum level7 level14 level21)
(sum level7 level16 level23)
(sum level7 level21 level28)
(sum level8 level6 level14)
(sum level8 level9 level17)
(sum level8 level10 level18)
(sum level8 level14 level22)
(sum level8 level16 level24)
(sum level8 level21 level29)
(sum level9 level6 level15)
(sum level9 level9 level18)
(sum level9 level10 level19)
(sum level9 level14 level23)
(sum level9 level16 level25)
(sum level9 level21 level30)
(sum level10 level6 level16)
(sum level10 level9 level19)
(sum level10 level10 level20)
(sum level10 level14 level24)
(sum level10 level16 level26)
(sum level10 level21 level31)
(sum level11 level6 level17)
(sum level11 level9 level20)
(sum level11 level10 level21)
(sum level11 level14 level25)
(sum level11 level16 level27)
(sum level11 level21 level32)
(sum level12 level6 level18)
(sum level12 level9 level21)
(sum level12 level10 level22)
(sum level12 level14 level26)
(sum level12 level16 level28)
(sum level12 level21 level33)
(sum level13 level6 level19)
(sum level13 level9 level22)
(sum level13 level10 level23)
(sum level13 level14 level27)
(sum level13 level16 level29)
(sum level13 level21 level34)
(sum level14 level6 level20)
(sum level14 level9 level23)
(sum level14 level10 level24)
(sum level14 level14 level28)
(sum level14 level16 level30)
(sum level14 level21 level35)
(sum level15 level6 level21)
(sum level15 level9 level24)
(sum level15 level10 level25)
(sum level15 level14 level29)
(sum level15 level16 level31)
(sum level15 level21 level36)
(sum level16 level6 level22)
(sum level16 level9 level25)
(sum level16 level10 level26)
(sum level16 level14 level30)
(sum level16 level16 level32)
(sum level16 level21 level37)
(sum level17 level6 level23)
(sum level17 level9 level26)
(sum level17 level10 level27)
(sum level17 level14 level31)
(sum level17 level16 level33)
(sum level17 level21 level38)
(sum level18 level6 level24)
(sum level18 level9 level27)
(sum level18 level10 level28)
(sum level18 level14 level32)
(sum level18 level16 level34)
(sum level18 level21 level39)
(sum level19 level6 level25)
(sum level19 level9 level28)
(sum level19 level10 level29)
(sum level19 level14 level33)
(sum level19 level16 level35)
(sum level19 level21 level40)
(sum level20 level6 level26)
(sum level20 level9 level29)
(sum level20 level10 level30)
(sum level20 level14 level34)
(sum level20 level16 level36)
(sum level20 level21 level41)
(sum level21 level6 level27)
(sum level21 level9 level30)
(sum level21 level10 level31)
(sum level21 level14 level35)
(sum level21 level16 level37)
(sum level21 level21 level42)
(sum level22 level6 level28)
(sum level22 level9 level31)
(sum level22 level10 level32)
(sum level22 level14 level36)
(sum level22 level16 level38)
(sum level22 level21 level43)
(sum level23 level6 level29)
(sum level23 level9 level32)
(sum level23 level10 level33)
(sum level23 level14 level37)
(sum level23 level16 level39)
(sum level23 level21 level44)
(sum level24 level6 level30)
(sum level24 level9 level33)
(sum level24 level10 level34)
(sum level24 level14 level38)
(sum level24 level16 level40)
(sum level24 level21 level45)
(sum level25 level6 level31)
(sum level25 level9 level34)
(sum level25 level10 level35)
(sum level25 level14 level39)
(sum level25 level16 level41)
(sum level25 level21 level46)
(sum level26 level6 level32)
(sum level26 level9 level35)
(sum level26 level10 level36)
(sum level26 level14 level40)
(sum level26 level16 level42)
(sum level26 level21 level47)
(sum level27 level6 level33)
(sum level27 level9 level36)
(sum level27 level10 level37)
(sum level27 level14 level41)
(sum level27 level16 level43)
(sum level27 level21 level48)
(sum level28 level6 level34)
(sum level28 level9 level37)
(sum level28 level10 level38)
(sum level28 level14 level42)
(sum level28 level16 level44)
(sum level28 level21 level49)
(sum level29 level6 level35)
(sum level29 level9 level38)
(sum level29 level10 level39)
(sum level29 level14 level43)
(sum level29 level16 level45)
(sum level29 level21 level50)
(sum level30 level6 level36)
(sum level30 level9 level39)
(sum level30 level10 level40)
(sum level30 level14 level44)
(sum level30 level16 level46)
(sum level30 level21 level51)
(sum level31 level6 level37)
(sum level31 level9 level40)
(sum level31 level10 level41)
(sum level31 level14 level45)
(sum level31 level16 level47)
(sum level31 level21 level52)
(sum level32 level6 level38)
(sum level32 level9 level41)
(sum level32 level10 level42)
(sum level32 level14 level46)
(sum level32 level16 level48)
(sum level32 level21 level53)
(sum level33 level6 level39)
(sum level33 level9 level42)
(sum level33 level10 level43)
(sum level33 level14 level47)
(sum level33 level16 level49)
(sum level33 level21 level54)
(sum level34 level6 level40)
(sum level34 level9 level43)
(sum level34 level10 level44)
(sum level34 level14 level48)
(sum level34 level16 level50)
(sum level34 level21 level55)
(sum level35 level6 level41)
(sum level35 level9 level44)
(sum level35 level10 level45)
(sum level35 level14 level49)
(sum level35 level16 level51)
(sum level35 level21 level56)
(sum level36 level6 level42)
(sum level36 level9 level45)
(sum level36 level10 level46)
(sum level36 level14 level50)
(sum level36 level16 level52)
(sum level36 level21 level57)
(sum level37 level6 level43)
(sum level37 level9 level46)
(sum level37 level10 level47)
(sum level37 level14 level51)
(sum level37 level16 level53)
(sum level37 level21 level58)
(sum level38 level6 level44)
(sum level38 level9 level47)
(sum level38 level10 level48)
(sum level38 level14 level52)
(sum level38 level16 level54)
(sum level38 level21 level59)
(sum level39 level6 level45)
(sum level39 level9 level48)
(sum level39 level10 level49)
(sum level39 level14 level53)
(sum level39 level16 level55)
(sum level39 level21 level60)
(sum level40 level6 level46)
(sum level40 level9 level49)
(sum level40 level10 level50)
(sum level40 level14 level54)
(sum level40 level16 level56)
(sum level40 level21 level61)
(sum level41 level6 level47)
(sum level41 level9 level50)
(sum level41 level10 level51)
(sum level41 level14 level55)
(sum level41 level16 level57)
(sum level41 level21 level62)
(sum level42 level6 level48)
(sum level42 level9 level51)
(sum level42 level10 level52)
(sum level42 level14 level56)
(sum level42 level16 level58)
(sum level42 level21 level63)
(sum level43 level6 level49)
(sum level43 level9 level52)
(sum level43 level10 level53)
(sum level43 level14 level57)
(sum level43 level16 level59)
(sum level43 level21 level64)
(sum level44 level6 level50)
(sum level44 level9 level53)
(sum level44 level10 level54)
(sum level44 level14 level58)
(sum level44 level16 level60)
(sum level44 level21 level65)
(sum level45 level6 level51)
(sum level45 level9 level54)
(sum level45 level10 level55)
(sum level45 level14 level59)
(sum level45 level16 level61)
(sum level45 level21 level66)
(sum level46 level6 level52)
(sum level46 level9 level55)
(sum level46 level10 level56)
(sum level46 level14 level60)
(sum level46 level16 level62)
(sum level46 level21 level67)
(sum level47 level6 level53)
(sum level47 level9 level56)
(sum level47 level10 level57)
(sum level47 level14 level61)
(sum level47 level16 level63)
(sum level47 level21 level68)
(sum level48 level6 level54)
(sum level48 level9 level57)
(sum level48 level10 level58)
(sum level48 level14 level62)
(sum level48 level16 level64)
(sum level48 level21 level69)
(sum level49 level6 level55)
(sum level49 level9 level58)
(sum level49 level10 level59)
(sum level49 level14 level63)
(sum level49 level16 level65)
(sum level49 level21 level70)
(sum level50 level6 level56)
(sum level50 level9 level59)
(sum level50 level10 level60)
(sum level50 level14 level64)
(sum level50 level16 level66)
(sum level50 level21 level71)
(sum level51 level6 level57)
(sum level51 level9 level60)
(sum level51 level10 level61)
(sum level51 level14 level65)
(sum level51 level16 level67)
(sum level51 level21 level72)
(sum level52 level6 level58)
(sum level52 level9 level61)
(sum level52 level10 level62)
(sum level52 level14 level66)
(sum level52 level16 level68)
(sum level52 level21 level73)
(sum level53 level6 level59)
(sum level53 level9 level62)
(sum level53 level10 level63)
(sum level53 level14 level67)
(sum level53 level16 level69)
(sum level53 level21 level74)
(sum level54 level6 level60)
(sum level54 level9 level63)
(sum level54 level10 level64)
(sum level54 level14 level68)
(sum level54 level16 level70)
(sum level54 level21 level75)
(sum level55 level6 level61)
(sum level55 level9 level64)
(sum level55 level10 level65)
(sum level55 level14 level69)
(sum level55 level16 level71)
(sum level55 level21 level76)
(sum level56 level6 level62)
(sum level56 level9 level65)
(sum level56 level10 level66)
(sum level56 level14 level70)
(sum level56 level16 level72)
(sum level56 level21 level77)
(sum level57 level6 level63)
(sum level57 level9 level66)
(sum level57 level10 level67)
(sum level57 level14 level71)
(sum level57 level16 level73)
(sum level57 level21 level78)
(sum level58 level6 level64)
(sum level58 level9 level67)
(sum level58 level10 level68)
(sum level58 level14 level72)
(sum level58 level16 level74)
(sum level58 level21 level79)
(sum level59 level6 level65)
(sum level59 level9 level68)
(sum level59 level10 level69)
(sum level59 level14 level73)
(sum level59 level16 level75)
(sum level59 level21 level80)
(sum level60 level6 level66)
(sum level60 level9 level69)
(sum level60 level10 level70)
(sum level60 level14 level74)
(sum level60 level16 level76)
(sum level60 level21 level81)
(sum level61 level6 level67)
(sum level61 level9 level70)
(sum level61 level10 level71)
(sum level61 level14 level75)
(sum level61 level16 level77)
(sum level61 level21 level82)
(sum level62 level6 level68)
(sum level62 level9 level71)
(sum level62 level10 level72)
(sum level62 level14 level76)
(sum level62 level16 level78)
(sum level62 level21 level83)
(sum level63 level6 level69)
(sum level63 level9 level72)
(sum level63 level10 level73)
(sum level63 level14 level77)
(sum level63 level16 level79)
(sum level63 level21 level84)
(sum level64 level6 level70)
(sum level64 level9 level73)
(sum level64 level10 level74)
(sum level64 level14 level78)
(sum level64 level16 level80)
(sum level64 level21 level85)
(sum level65 level6 level71)
(sum level65 level9 level74)
(sum level65 level10 level75)
(sum level65 level14 level79)
(sum level65 level16 level81)
(sum level65 level21 level86)
(sum level66 level6 level72)
(sum level66 level9 level75)
(sum level66 level10 level76)
(sum level66 level14 level80)
(sum level66 level16 level82)
(sum level66 level21 level87)
(sum level67 level6 level73)
(sum level67 level9 level76)
(sum level67 level10 level77)
(sum level67 level14 level81)
(sum level67 level16 level83)
(sum level67 level21 level88)
(sum level68 level6 level74)
(sum level68 level9 level77)
(sum level68 level10 level78)
(sum level68 level14 level82)
(sum level68 level16 level84)
(sum level68 level21 level89)
(sum level69 level6 level75)
(sum level69 level9 level78)
(sum level69 level10 level79)
(sum level69 level14 level83)
(sum level69 level16 level85)
(sum level69 level21 level90)
(sum level70 level6 level76)
(sum level70 level9 level79)
(sum level70 level10 level80)
(sum level70 level14 level84)
(sum level70 level16 level86)
(sum level70 level21 level91)
(sum level71 level6 level77)
(sum level71 level9 level80)
(sum level71 level10 level81)
(sum level71 level14 level85)
(sum level71 level16 level87)
(sum level71 level21 level92)
(sum level72 level6 level78)
(sum level72 level9 level81)
(sum level72 level10 level82)
(sum level72 level14 level86)
(sum level72 level16 level88)
(sum level72 level21 level93)
(sum level73 level6 level79)
(sum level73 level9 level82)
(sum level73 level10 level83)
(sum level73 level14 level87)
(sum level73 level16 level89)
(sum level73 level21 level94)
(sum level74 level6 level80)
(sum level74 level9 level83)
(sum level74 level10 level84)
(sum level74 level14 level88)
(sum level74 level16 level90)
(sum level74 level21 level95)
(sum level75 level6 level81)
(sum level75 level9 level84)
(sum level75 level10 level85)
(sum level75 level14 level89)
(sum level75 level16 level91)
(sum level75 level21 level96)
(sum level76 level6 level82)
(sum level76 level9 level85)
(sum level76 level10 level86)
(sum level76 level14 level90)
(sum level76 level16 level92)
(sum level76 level21 level97)
(sum level77 level6 level83)
(sum level77 level9 level86)
(sum level77 level10 level87)
(sum level77 level14 level91)
(sum level77 level16 level93)
(sum level77 level21 level98)
(sum level78 level6 level84)
(sum level78 level9 level87)
(sum level78 level10 level88)
(sum level78 level14 level92)
(sum level78 level16 level94)
(sum level78 level21 level99)
(sum level79 level6 level85)
(sum level79 level9 level88)
(sum level79 level10 level89)
(sum level79 level14 level93)
(sum level79 level16 level95)
(sum level79 level21 level100)
(sum level80 level6 level86)
(sum level80 level9 level89)
(sum level80 level10 level90)
(sum level80 level14 level94)
(sum level80 level16 level96)
(sum level80 level21 level101)
(sum level81 level6 level87)
(sum level81 level9 level90)
(sum level81 level10 level91)
(sum level81 level14 level95)
(sum level81 level16 level97)
(sum level81 level21 level102)
(sum level82 level6 level88)
(sum level82 level9 level91)
(sum level82 level10 level92)
(sum level82 level14 level96)
(sum level82 level16 level98)
(sum level82 level21 level103)
(sum level83 level6 level89)
(sum level83 level9 level92)
(sum level83 level10 level93)
(sum level83 level14 level97)
(sum level83 level16 level99)
(sum level83 level21 level104)
(sum level84 level6 level90)
(sum level84 level9 level93)
(sum level84 level10 level94)
(sum level84 level14 level98)
(sum level84 level16 level100)
(sum level84 level21 level105)
(sum level85 level6 level91)
(sum level85 level9 level94)
(sum level85 level10 level95)
(sum level85 level14 level99)
(sum level85 level16 level101)
(sum level85 level21 level106)
(sum level86 level6 level92)
(sum level86 level9 level95)
(sum level86 level10 level96)
(sum level86 level14 level100)
(sum level86 level16 level102)
(sum level87 level6 level93)
(sum level87 level9 level96)
(sum level87 level10 level97)
(sum level87 level14 level101)
(sum level87 level16 level103)
(sum level88 level6 level94)
(sum level88 level9 level97)
(sum level88 level10 level98)
(sum level88 level14 level102)
(sum level88 level16 level104)
(sum level89 level6 level95)
(sum level89 level9 level98)
(sum level89 level10 level99)
(sum level89 level14 level103)
(sum level89 level16 level105)
(sum level90 level6 level96)
(sum level90 level9 level99)
(sum level90 level10 level100)
(sum level90 level14 level104)
(sum level90 level16 level106)
(sum level91 level6 level97)
(sum level91 level9 level100)
(sum level91 level10 level101)
(sum level91 level14 level105)
(sum level92 level6 level98)
(sum level92 level9 level101)
(sum level92 level10 level102)
(sum level92 level14 level106)
(sum level93 level6 level99)
(sum level93 level9 level102)
(sum level93 level10 level103)
(sum level94 level6 level100)
(sum level94 level9 level103)
(sum level94 level10 level104)
(sum level95 level6 level101)
(sum level95 level9 level104)
(sum level95 level10 level105)
(sum level96 level6 level102)
(sum level96 level9 level105)
(sum level96 level10 level106)
(sum level97 level6 level103)
(sum level97 level9 level106)
(sum level98 level6 level104)
(sum level99 level6 level105)
(sum level100 level6 level106)

(connected l0 l1)
(fuelcost level9 l0 l1)
(connected l0 l2)
(fuelcost level6 l0 l2)
(connected l0 l3)
(fuelcost level14 l0 l3)
(connected l1 l0)
(fuelcost level9 l1 l0)
(connected l1 l2)
(fuelcost level10 l1 l2)
(connected l1 l3)
(fuelcost level21 l1 l3)
(connected l2 l0)
(fuelcost level6 l2 l0)
(connected l2 l1)
(fuelcost level10 l2 l1)
(connected l2 l3)
(fuelcost level16 l2 l3)
(connected l3 l0)
(fuelcost level14 l3 l0)
(connected l3 l1)
(fuelcost level21 l3 l1)
(connected l3 l2)
(fuelcost level16 l3 l2)

(at t0 l3)
(fuel t0 level106)
(= (total-cost) 0)

(at p0 l0)
(at p1 l3)
(at p2 l1)
(at p3 l2)
(at p4 l0)
(at p5 l3)
(at p6 l2)
(at p7 l0)
(at p8 l2)
(at p9 l1)
(at p10 l3)
)

(:goal
(and
(at p0 l3)
(at p1 l0)
(at p2 l2)
(at p3 l0)
(at p4 l3)
(at p5 l2)
(at p6 l3)
(at p7 l2)
(at p8 l3)
(at p9 l0)
(at p10 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 0 of 11
2. (load p10 t0 l3)
   deleted: (at p10 l3)
   added: (in p10 t0)
   goals met: 0 of 11
3. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 0 of 11
4. (drive t0 l3 l1 level85 level21 level106)
   deleted: (at t0 l3) (fuel t0 level106)
   added: (at t0 l1) (fuel t0 level85)
   goals met: 0 of 11
5. (unload p10 t0 l1)
   deleted: (in p10 t0)
   added: (at p10 l1)
   goals met: 1 of 11
6. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 1 of 11
7. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 1 of 11
8. (drive t0 l1 l2 level75 level10 level85)
   deleted: (at t0 l1) (fuel t0 level85)
   added: (at t0 l2) (fuel t0 level75)
   goals met: 1 of 11
9. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 2 of 11
10. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 3 of 11
11. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 3 of 11
12. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 3 of 11
13. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 3 of 11
14. (drive t0 l2 l0 level69 level6 level75)
   deleted: (at t0 l2) (fuel t0 level75)
   added: (at t0 l0) (fuel t0 level69)
   goals met: 3 of 11
15. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 3 of 11
16. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 3 of 11
17. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 3 of 11
18. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 4 of 11
19. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 5 of 11
20. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 6 of 11
21. (drive t0 l0 l2 level63 level6 level69)
   deleted: (at t0 l0) (fuel t0 level69)
   added: (at t0 l2) (fuel t0 level63)
   goals met: 6 of 11
22. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 7 of 11
23. (drive t0 l2 l3 level47 level16 level63)
   deleted: (at t0 l2) (fuel t0 level63)
   added: (at t0 l3) (fuel t0 level47)
   goals met: 7 of 11
24. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 8 of 11
25. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 9 of 11
26. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 10 of 11
27. (unload p8 t0 l3)
   deleted: (in p8 t0)
   added: (at p8 l3)
   goals met: 11 of 11
